tutorials/RAS/lockRelease/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-9;

boundaryField
{
    inlet
    {
        type           zeroGradient;  
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    top
    {
        type            kqRWallFunction;
	value           $internalField;
    }

    bed
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
