tutorials/RAS/lockRelease/Allrun
#!/bin/sh

# Create the mesh
blockMesh
makeFaMesh

# create the intial time folder
cp -r 0_org 0

funkySetFields -time 0

# Run sedExnerFoam
sedExnerFoam > log
