tutorials/RAS/lockRelease/constant/suspensionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      suspensionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * /

suspension     off;

erosionDeposition off;

wallDiffusivity
{
    alpha      5e-6;
    beta       5;  // default is 5
}

fallModel
{
    type       fixedValue;
    value      0.0;
}

hindranceModel
{
    type       none;
}

// ************************************************************************* //
