tutorials/RAS/lockRelease/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler implicit;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
// UEqn
    div(phi,U)     Gauss linearUpwind gad(U);
// CEqn
    div(phip,Cs)   Gauss limitedLinear 1;
// SEqn
    div(phi,S)     Gauss limitedLinear 1;
// pEqn
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
// k and EpsilonEqn
    div(phi,k)     Gauss limitedLinear 1;
    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,omega) Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement) Gauss linear corrected;
    /*// UEqn
    laplacian(nuEff,U) Gauss linear;
// CEqn
    laplacian(epsEff,C) Gauss linear;
// pEqn
    laplacian((1|A(U)),p) Gauss linear;
// k and EpsilonEqn 
    laplacian(DkEff,k) Gauss linear;
    laplacian(DkEff,beta) Gauss linear;
    laplacian(DepsilonEff,epsilon) Gauss linear;
    laplacian(DepsilonEff,beta) Gauss linear;
        laplacian(DomegaEff,omega) Gauss linear;*/
}


interpolationSchemes
{
    default  linear;
    //flux((U+Ws)) downwind phip;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
    C               ;
}
wallDist
{
method meshWave;
}


// ************************************************************************* //
